{
  "name": "Laura Unterguggenberger",
  "phone": "(510) 890-6433",
  "email": "laura.unterguggenberger@gmail.com",
  "version": "April 2023",
  "linkedin": "www.linkedin.com/in/lauraunterguggenberger",
  "summary": "Dynamic Software Engineering Professional with over 10 years of experience in developing innovative software solutions. Expert in leading the design and implementation of features in high-growth Agile environments. Passionate about Test-Driven Development (TDD), pair programming, and mentoring emerging talent in the technology sector. Proven track record of enhancing operational efficiency and driving significant growth in user acquisition through strategic technical innovations.",
  "section_title": "Professional Experience",
  "experience": [
    {
      "company": "PATHPOINT",
      "sub_header": "A technology company specializing in simplifying the insurance buying process through innovative software solutions.",
      "title": "Senior Engineer",
      "time period": "October 2020 - Present",
      "bullets": [
        "Spearheaded the Carrier Logic integrations using Golang, reducing onboarding time for new carriers from 6 months to a matter of months by automating the translation of carrier rules into a dynamic question generation system.",
        "Implemented microservice scaling and security enhancements, including in-memory caching and gRPC, supporting a 5x increase in user acquisition and revenue-generating submissions.",
        "Mentored junior engineers, improving project design, documentation, and stakeholder engagement."
      ]
    },
    {
      "company": "FUTURE RESEARCH",
      "sub_header": "A startup focused on integrating technology with personal fitness to enhance coaching efficiency and client engagement.",
      "title": "Software Engineer",
      "time period": "March 2019 - April 2020",
      "bullets": [
        "Developed RESTful APIs on AWS for a personal fitness coaching app, automating scheduling and client engagement processes, significantly reducing cognitive overhead for fitness coaches."
      ]
    },
    {
      "company": "PIVOTAL",
      "sub_header": "A cloud-native platform provider that enables software developers to build, deploy, and operate software more efficiently.",
      "title": "Staff Engineer",
      "time period": "January 2018 - March 2019",
      "bullets": [
        "Enhanced developer efficiency for ISV developers on PKS by optimizing the CI/CD service's React/Redux dashboard, reducing time to market for Pivotal installation packages.",
        "Led Kubernetes solutions development for the Platform Engineering team, improving GCP environment utilization."
      ]
    },
    {
      "company": "JIFF",
      "sub_header": "Health technology company offering a platform for companies to engage employees in health and wellness programs.",
      "title": "Senior Engineer",
      "time period": "October 2020 - Present",
      "bullets": [
        "Led backend development for the Jiffinity Rewards Center, enhancing employer-sponsored incentives programs and improving user engagement and NPS.",
        "Redesigned the user registration process, reducing friction and significantly improving completion rates."
      ]
    },
    {
      "company": "DELIV, INC",
      "sub_header": "A same-day delivery service company that partners with retailers to enable them to offer same-day delivery.",
      "title": "Senior Engineer",
      "time period": "May 2015 - December 2016",
      "bullets": [
        "Fullstack Ruby on Rails engineer, enhancing the backend for RESTful API services and client-side features, leading to more efficient vehicle routing and a better driver experience.",
        "Optimized delivery routing algorithms, reducing runtime for bulk deliveries from 1 hour to under 5 minutes."
      ]
    },
    {
      "company": "LEEO, INC",
      "sub_header": "A company focused on smart home technology, known for its innovative safety devices.",
      "title": "Embedded Software Engineer",
      "time period": "February 2014 - April 2015",
      "bullets": [
        "Drove digital signal processing efforts to distinguish smoke and carbon monoxide alerts, triggering notifications to backend servers and mobile applications.",
        "Developed API for communication between iOS and the Leeo Nightlight system, enhancing device interoperability and user experience."
      ]
    },
    {
      "company": "MILYONI, INC",
      "sub_header": "A pioneer in creating social entertainment experiences, specializing in integrating real-time social media with content streaming.",
      "title": "Software Engineer",
      "time period": "March 2013 - February 2014",
      "bullets": [
        "Created immersive social experiences using Facebook, Twitter, and Google+ APIs, enhancing user engagement with real-time updates and interactive chat functionalities.",
        "Developed an API and SDK that empowered users to quickly integrate custom social widgets into their own websites, fostering community engagement and personalized interactions."
      ]
    },
    {
      "company": "EMPOWERED CAREERS",
      "sub_header": "A company offering online education services aimed at career advancement through technology-enhanced learning.",
      "title": "Software Engineer",
      "time period": "October 2011 - December 2012",
      "bullets": [
        "Leveraged the Canvas API to integrate a PHP Messaging System for the client's iPad app, improving communication and resource accessibility for users.",
        "Implemented object-oriented design patterns and developed Salesforce object models, contributing to streamlined operations and automated testing processes."
      ]
    },
    {
      "company": "MICROSEMI CORPORATION",
      "sub_header": "A leader in FPGA and programmable logic solutions, catering to a wide range of engineering applications.",
      "title": "Lead QA Engineer",
      "time period": "October 2020 - Present",
      "bullets": [
        "Conducted comprehensive testing for FPGA-based applications, ensuring high reliability and performance.",
        "Led QA for the SmartDesign tool, incorporating testing hooks and unit tests to maintain high code quality and application integrity."
      ]
    }
  ],
  "languages & frameworks": [
    "Languages & Frameworks: Ruby on Rails (10+ years), TypeScript, Golang, NodeJS, React with Redux, Python, GraphQL, CSS, Linux Bash Scripting",
    "Technologies & Tools: Docker, AWS (RDS, ECS, API Gateway, CloudWatch), Kubernetes, Pivotal Cloud Foundry, CI/CD Pipelines",
    "Methodologies: Agile Development, Test-Driven Development (TDD), Pair Programming, Backend and Fullstack Engineering"
  ],
  "education": {
    "level": "BS In Computer Science",
    "school": "San Jose State University",
    "year": 2006
  }
}